In [1]:
import pandas as pd

In [2]:
df=pd.read_csv("JEOPARDY_CSV.csv")

In [3]:
df.head(5)

,Show Number,Air Date,Round,Category,Value,Question,Answer
0,4680,12/31/2004,Jeopardy!,HISTORY,$200,"For the last 8 years of his life, Galileo was ...",Copernicus
1,4680,12/31/2004,Jeopardy!,ESPN's TOP 10 ALL-TIME ATHLETES,$200,No. 2: 1912 Olympian; football star at Carlisl...,Jim Thorpe
2,4680,12/31/2004,Jeopardy!,EVERYBODY TALKS ABOUT IT...,$200,The city of Yuma in this state has a record av...,Arizona
3,4680,12/31/2004,Jeopardy!,THE COMPANY LINE,$200,"In 1963, live on ""The Art Linkletter Show"", th...",McDonald's
4,4680,12/31/2004,Jeopardy!,EPITAPHS & TRIBUTES,$200,"Signer of the Dec. of Indep., framer of the Co...",John Adams

In [4]:
df.columns

Index(['Show Number', ' Air Date', ' Round', ' Category', ' Value',
       ' Question', ' Answer'],
      dtype='object')

In [5]:
df.dtypes

Show Number     int64
 Air Date      object
 Round         object
 Category      object
 Value         object
 Question      object
 Answer        object
dtype: object

# 1a
How many rows are there in the dataframe? What does a row represent in this
dataset? What is the “grain”?

In [ ]:
df.shape[0]

There are 216930 rows in the dataframe. Each row represent a jeopardy question.

# 1b
Clean the data. How do you need to “clean” it? What is “dirty” about this data?
- There are white space in the begining of the columns names that needs to removed
- The 'Air Date' column data type is an object which needs to be converted into datetime
- The price column has dollar signs,commas,spaces and none values which needs to be removed for numerical computation

In [6]:
df.columns = df.columns.str.lstrip()
df.columns

Index(['Show Number', 'Air Date', 'Round', 'Category', 'Value', 'Question',
       'Answer'],
      dtype='object')

In [7]:
df['Air Date'] = pd.to_datetime(df['Air Date'])
df.dtypes

Show Number             int64
Air Date       datetime64[ns]
Round                  object
Category               object
Value                  object
Question               object
Answer                 object
dtype: object

In [8]:
df['Value'].unique()

array(['$200 ', '$400 ', '$600 ', '$800 ', '$2,000 ', '$1,000 ',
       '$1,200 ', '$1,600 ', '$3,200 ', 'None', '$5,000 ', '$100 ',
       '$300 ', '$500 ', '$1,500 ', '$4,800 ', '$1,800 ', '$1,100 ',
       '$2,200 ', '$3,400 ', '$3,000 ', '$4,000 ', '$6,800 ', '$1,900 ',
       '$3,100 ', '$700 ', '$1,400 ', '$2,800 ', '$8,000 ', '$6,000 ',
       '$2,400 ', '$12,000 ', '$3,800 ', '$2,500 ', '$6,200 ', '$10,000 ',
       '$7,000 ', '$1,492 ', '$7,400 ', '$1,300 ', '$7,200 ', '$2,600 ',
       '$3,300 ', '$5,400 ', '$4,500 ', '$2,100 ', '$900 ', '$3,600 ',
       '$2,127 ', '$367 ', '$4,400 ', '$3,500 ', '$2,900 ', '$3,900 ',
       '$4,100 ', '$4,600 ', '$10,800 ', '$2,300 ', '$5,600 ', '$1,111 ',
       '$8,200 ', '$5,800 ', '$750 ', '$7,500 ', '$1,700 ', '$9,000 ',
       '$6,100 ', '$1,020 ', '$4,700 ', '$2,021 ', '$5,200 ', '$3,389 ',
       '$4,200 ', '$5 ', '$2,001 ', '$1,263 ', '$4,637 ', '$3,201 ',
       '$6,600 ', '$3,700 ', '$2,990 ', '$5,500 ', '$14,000 ', '$2,700 ',
       '$6,400 ', '$350 ', '$8,600 ', '$6,300 ', '$250 ', '$3,989 ',
       '$8,917 ', '$9,500 ', '$1,246 ', '$6,435 ', '$8,800 ', '$2,222 ',
       '$2,746 ', '$10,400 ', '$7,600 ', '$6,700 ', '$5,100 ', '$13,200 ',
       '$4,300 ', '$1,407 ', '$12,400 ', '$5,401 ', '$7,800 ', '$1,183 ',
       '$1,203 ', '$13,000 ', '$11,600 ', '$14,200 ', '$1,809 ',
       '$8,400 ', '$8,700 ', '$11,000 ', '$5,201 ', '$1,801 ', '$3,499 ',
       '$5,700 ', '$601 ', '$4,008 ', '$50 ', '$2,344 ', '$2,811 ',
       '$18,000 ', '$1,777 ', '$3,599 ', '$9,800 ', '$796 ', '$3,150 ',
       '$20 ', '$1,810 ', '$22 ', '$9,200 ', '$1,512 ', '$8,500 ',
       '$585 ', '$1,534 ', '$13,800 ', '$5,001 ', '$4,238 ', '$16,400 ',
       '$1,347 ', '$2,547 ', '$11,200 '], dtype=object)

In [9]:
df['Value']=df['Value'].str.replace('$','')
df['Value']=df['Value'].str.replace(',','')
df['Value']=df['Value'].str.replace(' ','')
df['Value']=df['Value'].str.replace('None','0')
df['Value'] =  pd.to_numeric(df['Value'])

In [10]:
df['Value'].dtype

dtype('int64')

# 1c
How many unique shows were there each year?

In [12]:
group_year=df.groupby(df['Air Date'].dt.year)
shows=group_year['Show Number'].nunique()

unique_shows=pd.DataFrame({"Show":shows})
unique_shows

          Show
Air Date
1984        23
1985        16
1986        25
1987        22
1988        22
1989        36
1990        73
1991        24
1992        32
1993        35
1994        19
1995        19
1996        83
1997       221
1998       223
1999       229
2000       225
2001       203
2002       114
2003       158
2004       220
2005       225
2006       230
2007       231
2008       232
2009       226
2010       231
2011       224
2012        19